MIKAIL-OZTURK/STM32F4_DISCOVERY/003_0_STDP_BUTTON_CONTROL/src/main.c
#include "stm32f4xx.h"
#include "stm32f4_discovery.h"

GPIO_InitTypeDef GPIO_InitStruct;

void GPIO_Config()
{
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOA, ENABLE);	// A portu için (Buton) AHB1 bus'ý aktif edildi
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOD, ENABLE);	// D portu için (LED) AHB1 bus'ý aktif edildi.

	// BUTON AYALARI -->
	GPIO_InitStruct.GPIO_Mode = 0x00;			// GPIO_InitStruct.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_0;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_DOWN;
	GPIO_InitStruct.GPIO_Speed = 0x03;	// 	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;

	GPIO_Init(GPIOA, &GPIO_InitStruct);		// Buton ayarlarý A portuna yüklendi
	/* -------------------------------------------------------------- */

	// LED AYARLARI -->
	GPIO_InitStruct.GPIO_Pin = GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15;
	GPIO_InitStruct.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;

	GPIO_Init(GPIOD, &GPIO_InitStruct);		// LED ayarlarý D portuna yüklendi.
	/* -------------------------------------------------------------- */
}
void delay(uint32_t time)
{
	while(time--);
}

int main(void)
{
	GPIO_Config();

  while (1)
  {
	  if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_0))		// Buton basýlýrsa -->
	  {
		  // BOTUN ARKINI ÖNLEMEK ÝÇÝN YAPILAN ÝÞLEMLER -->
		  while(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_0));		// Hala butona basýlý ise
		  delay(3360000);	// 200ms							// Bekle...

	/* --------------------------------------------------------------------------*/

		  GPIO_ToggleBits(GPIOD, GPIO_Pin_12 | GPIO_Pin_13 | GPIO_Pin_14 | GPIO_Pin_15);
	  }
  }
}

void EVAL_AUDIO_TransferComplete_CallBack(uint32_t pBuffer, uint32_t Size){
  /* TODO, implement your code here */
  return;
}

uint16_t EVAL_AUDIO_GetSampleCallBack(void){
  /* TODO, implement your code here */
  return -1;
}
